GopalSaraf/Practicals/PSDL/include/proc/pic16lf19175.h
extern volatile RE1PPSbits_t RE1PPSbits __at(0x1F31);
// bitfield macros
#define _RE1PPS_RE1PPS0_POSN                                0x0
#define _RE1PPS_RE1PPS0_POSITION                            0x0
#define _RE1PPS_RE1PPS0_SIZE                                0x1
#define _RE1PPS_RE1PPS0_LENGTH                              0x1
#define _RE1PPS_RE1PPS0_MASK                                0x1
#define _RE1PPS_RE1PPS1_POSN                                0x1
#define _RE1PPS_RE1PPS1_POSITION                            0x1
#define _RE1PPS_RE1PPS1_SIZE                                0x1
#define _RE1PPS_RE1PPS1_LENGTH                              0x1
#define _RE1PPS_RE1PPS1_MASK                                0x2
#define _RE1PPS_RE1PPS2_POSN                                0x2
#define _RE1PPS_RE1PPS2_POSITION                            0x2
#define _RE1PPS_RE1PPS2_SIZE                                0x1
#define _RE1PPS_RE1PPS2_LENGTH                              0x1
#define _RE1PPS_RE1PPS2_MASK                                0x4
#define _RE1PPS_RE1PPS3_POSN                                0x3
#define _RE1PPS_RE1PPS3_POSITION                            0x3
#define _RE1PPS_RE1PPS3_SIZE                                0x1
#define _RE1PPS_RE1PPS3_LENGTH                              0x1
#define _RE1PPS_RE1PPS3_MASK                                0x8
#define _RE1PPS_RE1PPS4_POSN                                0x4
#define _RE1PPS_RE1PPS4_POSITION                            0x4
#define _RE1PPS_RE1PPS4_SIZE                                0x1
#define _RE1PPS_RE1PPS4_LENGTH                              0x1
#define _RE1PPS_RE1PPS4_MASK                                0x10

// Register: RE2PPS
#define RE2PPS RE2PPS
extern volatile unsigned char           RE2PPS              __at(0x1F32);
#ifndef _LIB_BUILD
asm("RE2PPS equ 01F32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE2PPS0                :1;
        unsigned RE2PPS1                :1;
        unsigned RE2PPS2                :1;
        unsigned RE2PPS3                :1;
        unsigned RE2PPS4                :1;
    };
} RE2PPSbits_t;
extern volatile RE2PPSbits_t RE2PPSbits __at(0x1F32);
// bitfield macros
#define _RE2PPS_RE2PPS0_POSN                                0x0
#define _RE2PPS_RE2PPS0_POSITION                            0x0
#define _RE2PPS_RE2PPS0_SIZE                                0x1
#define _RE2PPS_RE2PPS0_LENGTH                              0x1
#define _RE2PPS_RE2PPS0_MASK                                0x1
#define _RE2PPS_RE2PPS1_POSN                                0x1
#define _RE2PPS_RE2PPS1_POSITION                            0x1
#define _RE2PPS_RE2PPS1_SIZE                                0x1
#define _RE2PPS_RE2PPS1_LENGTH                              0x1
#define _RE2PPS_RE2PPS1_MASK                                0x2
#define _RE2PPS_RE2PPS2_POSN                                0x2
#define _RE2PPS_RE2PPS2_POSITION                            0x2
#define _RE2PPS_RE2PPS2_SIZE                                0x1
#define _RE2PPS_RE2PPS2_LENGTH                              0x1
#define _RE2PPS_RE2PPS2_MASK                                0x4
#define _RE2PPS_RE2PPS3_POSN                                0x3
#define _RE2PPS_RE2PPS3_POSITION                            0x3
#define _RE2PPS_RE2PPS3_SIZE                                0x1
#define _RE2PPS_RE2PPS3_LENGTH                              0x1
#define _RE2PPS_RE2PPS3_MASK                                0x8
#define _RE2PPS_RE2PPS4_POSN                                0x4
#define _RE2PPS_RE2PPS4_POSITION                            0x4
#define _RE2PPS_RE2PPS4_SIZE                                0x1
#define _RE2PPS_RE2PPS4_LENGTH                              0x1
#define _RE2PPS_RE2PPS4_MASK                                0x10

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x1F38);
#ifndef _LIB_BUILD
asm("ANSELA equ 01F38h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned ANSA3                  :1;
        unsigned ANSA4                  :1;
        unsigned                        :1;
        unsigned ANSA6                  :1;
        unsigned ANSA7                  :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x1F38);
// bitfield macros
#define _ANSELA_ANSA0_POSN                                  0x0
#define _ANSELA_ANSA0_POSITION                              0x0
#define _ANSELA_ANSA0_SIZE                                  0x1
#define _ANSELA_ANSA0_LENGTH                                0x1
#define _ANSELA_ANSA0_MASK                                  0x1
#define _ANSELA_ANSA1_POSN                                  0x1
#define _ANSELA_ANSA1_POSITION                              0x1
#define _ANSELA_ANSA1_SIZE                                  0x1
#define _ANSELA_ANSA1_LENGTH                                0x1
#define _ANSELA_ANSA1_MASK                                  0x2
#define _ANSELA_ANSA2_POSN                                  0x2
#define _ANSELA_ANSA2_POSITION                              0x2
#define _ANSELA_ANSA2_SIZE                                  0x1
#define _ANSELA_ANSA2_LENGTH                                0x1
#define _ANSELA_ANSA2_MASK                                  0x4
#define _ANSELA_ANSA3_POSN                                  0x3
#define _ANSELA_ANSA3_POSITION                              0x3
#define _ANSELA_ANSA3_SIZE                                  0x1
#define _ANSELA_ANSA3_LENGTH                                0x1
#define _ANSELA_ANSA3_MASK                                  0x8
#define _ANSELA_ANSA4_POSN                                  0x4
#define _ANSELA_ANSA4_POSITION                              0x4
#define _ANSELA_ANSA4_SIZE                                  0x1
#define _ANSELA_ANSA4_LENGTH                                0x1
#define _ANSELA_ANSA4_MASK                                  0x10
#define _ANSELA_ANSA6_POSN                                  0x6
#define _ANSELA_ANSA6_POSITION                              0x6
#define _ANSELA_ANSA6_SIZE                                  0x1
#define _ANSELA_ANSA6_LENGTH                                0x1
#define _ANSELA_ANSA6_MASK                                  0x40
#define _ANSELA_ANSA7_POSN                                  0x7
#define _ANSELA_ANSA7_POSITION                              0x7
#define _ANSELA_ANSA7_SIZE                                  0x1
#define _ANSELA_ANSA7_LENGTH                                0x1
#define _ANSELA_ANSA7_MASK                                  0x80

